var level = require('level');
const uuidv1 = require('uuid/v1');

var db = level('d:/diploma/department/model/db/disc', {
  create_if_missing: true,
  valueEncoding: 'json'
});
 var data = [
    {kurs:'1',semestr:'1',name:"Сучасні інформаційні технології в економіці", prof:"Гарко І.І."},
    {kurs:'1',semestr:'1',name:"Програмування та прикладні інформаційні системи", prof:"Духновська К.К."},
    {kurs:'1',semestr:'1',name:"Алгебра", prof:"Жихарєва Ю.І."},
    {kurs:'1',semestr:'1',name:"Інформаційні системи і технології в статистиці", prof:"Жихарєва Ю.І."},
    {kurs:'1',semestr:'1',name:"Математичний аналіз", prof:"Жихарєва Ю.І."},
    {kurs:'1',semestr:'1',name:"Програмування та прикладні інформаційні системи", prof:"Міронова В.Л."},
    {kurs:'1',semestr:'1',name:"Дискретна математика (з використанням інформаційних технологій)", prof:"Пирог М.В."},
    {kurs:'1',semestr:'1',name:"Дискретна математика (з використанням інформаційних технологій)", prof:"Плескач В.Л."},

  {kurs:'1',semestr:'2',name:"Інформаційні системи в обліку та аудиті", prof:"Духновська К.К."},
  {kurs:'1',semestr:'2',name:"Чисельні методи", prof:"Жихарєва Ю.І."},
  {kurs:'1',semestr:'2',name:"Прикладні інформаційні системи", prof:"Жихарєва Ю.І."},
  {kurs:'1',semestr:'2',name:"Програмування та прикладні інформаційні системи", prof:"Міронова В.Л."},
  {kurs:'1',semestr:'2',name:"Алгоритми і структури даних", prof:"Пирог М.В."},
  {kurs:'1',semestr:'2',name:"Прикладні інформаційні системи", prof:"Пирог М.В."},
  {kurs:'1',semestr:'2',name:"Алгоритми і структури даних", prof:"Плескач В.Л."},

  {kurs:'2',semestr:'1',name:"Теорія ймовірностей, ймовірнісні процеси та математична статистика", prof:"Гарко І.І."},
  {kurs:'2',semestr:'1',name:"Реляційні та постреляційні промислові бази даних", prof:"Домрачев В.М."},
  {kurs:'2',semestr:'1',name:"Методи та засоби об'єктно-орієнтованого проектування та програмування", prof:"Духновська К.К."},
  {kurs:'2',semestr:'1',name:"Прикладна статистика (з використанням інформаційних технологій)", prof:"Жихарєва Ю.І."},
  {kurs:'2',semestr:'1',name:"Оброблення зображень та мультимедіа", prof:"Сайко В.Г."},
  {kurs:'2',semestr:'1',name:"Прикладна статистика (з використанням інформаційних технологій)", prof:"Сайко В.Г."},
  {kurs:'2',semestr:'1',name:"Організація та обробка електронної інформації", prof:"Сайко В.Г."},

  {kurs:'2',semestr:'2',name:"Програмне забезпечення інформаційних систем", prof:"Домрачев В.М."},
  {kurs:'2',semestr:'2',name:"Реляційні та постреляційні промислові бази даних", prof:"Домрачев В.М."},
  {kurs:'2',semestr:'2',name:"Методи та засоби об'єктно-орієнтованого проектування та програмування", prof:"Духновська К.К."},
  {kurs:'2',semestr:'2',name:"Програмне забезпечення інформаційних систем", prof:"Духновська К.К."},
  {kurs:'2',semestr:'2',name:"Планування інформаційних систем (англ. мовою) (дисципліна вільного вибору аспіранта,  перелік №2)", prof:"Міронова В.Л."},
  {kurs:'2',semestr:'2',name:"Інформаційні системи і технології на підприємствах", prof:"Пирог М.В."},
  {kurs:'2',semestr:'2',name:"Комп'ютерні системи", prof:"Сайко В.Г."},

  {kurs:'3',semestr:'1',name:"Кросплатформене програмування", prof:"Домрачев В.М."},
  {kurs:'3',semestr:'1',name:"Організація баз даних і знань", prof:"Домрачев В.М."},
  {kurs:'3',semestr:'1',name:"Архітектура та проектування програмного забезпечення", prof:"Духновська К.К."},
  {kurs:'3',semestr:'1',name:"Системи підтримки прийняття рішень", prof:"Пирог М.В."},
  {kurs:'3',semestr:'1',name:"Інформаційні системи і технології на підприємствах", prof:"Пирог М.В."},
  {kurs:'3',semestr:'1',name:"Методи прийняття рішень", prof:"Пирог М.В."},
  {kurs:'3',semestr:'1',name:"Архітектура та проектування програмного забезпечення", prof:"Сайко В.Г."},
  {kurs:'3',semestr:'1',name:"Інформаційні системи і технології на підприємствах", prof:"Плескач В.Л."},
  {kurs:'3',semestr:'1',name:"Системи підтримки прийняття рішень", prof:"Плескач В.Л."},

  {kurs:'3',semestr:'2',name:"Технології промислового розроблення програм", prof:"Духновська К.К."},
  {kurs:'3',semestr:'2',name:"Веб-технології", prof:"Міронова В.Л."},
  {kurs:'3',semestr:'2',name:"Проектування і програмування сайтів", prof:"Міронова В.Л."},
  {kurs:'3',semestr:'2',name:"Моделювання бізнес-процесів", prof:"Пирог М.В."},

  {kurs:'4',semestr:'1',name:"Інтегровані середовища розробки модульних кросплатформних застосувань", prof:"Домрачев В.М."},
  {kurs:'4',semestr:'1',name:"Розподілені інформаційно-аналітичні системи", prof:"Домрачев В.М."},
  {kurs:'4',semestr:'1',name:"Програмування мультимедійних, ігрових та розважальних систем", prof:"Духновська К.К."},
  {kurs:'4',semestr:'1',name:"Програмування та застосунки інформаційних систем", prof:"Духновська К.К."},
  {kurs:'4',semestr:'1',name:"Якість програмного забезпечення та тестування", prof:"Міронова В.Л."},
  {kurs:'4',semestr:'1',name:"Програмування та застосунки інформаційних систем", prof:"Міронова В.Л."},
  {kurs:'4',semestr:'1',name:"Захист інформації", prof:"Сайко В.Г."},
  {kurs:'4',semestr:'1',name:"Інформаційний бізнес", prof:"Плескач В.Л."},

{kurs:'4',semestr:'2',name:"Інформаціний менеджмент", prof:"Гарко І.І."},
{kurs:'4',semestr:'2',name:"Математичні пакети програмних засобів", prof:"Гарко І.І."},
{kurs:'4',semestr:'2',name:"Програмування для мобільних пристроїв", prof:"Домрачев В.М."},
{kurs:'4',semestr:'2',name:"Проектування програм", prof:"Домрачев В.М."},
{kurs:'4',semestr:'2',name:"Математичні пакети програмних засобів", prof:"Жихарєва Ю.І."},
{kurs:'4',semestr:'2',name:"Основи промислової розробки програм", prof:"Міронова В.Л."},
{kurs:'4',semestr:'2',name:"Архітектура обчислювальних систем", prof:"Сайко В.Г."},
{kurs:'4',semestr:'2',name:"Проектування програм", prof:"Плескач В.Л."}
];

for(i in data){
  db.put(uuidv1(), data[i]);
}

var data1 = [];
db.createReadStream()
  .on('data', function (entry) {
    data1.push(entry);
}).on('end', function(){
  console.log(JSON.stringify(data1));
})
